{
  "<|endoftext|>": 151643,
  "<|im_start|>": 151644,
  "<|im_end|>": 151645,
  "<|object_ref_start|>": 151646,
  "<|object_ref_end|>": 151647,
  "<|box_start|>": 151648,
  "<|box_end|>": 151649,
  "<|quad_start|>": 151650,
  "<|quad_end|>": 151651,
  "<|vision_start|>": 151652,
  "<|vision_end|>": 151653,
  "<|vision_pad|>": 151654,
  "<|image_pad|>": 151655,
  "<|video_pad|>": 151656,
  "<|ref_start|>": 151657,
  "<|ref_end|>": 151658,
  "<|md_start|>": 151659,
  "<|md_end|>": 151660,
  "<ched>": 151661,
  "<ecel>": 151662,
  "<fcel>": 151663,
  "<lcel>": 151664,
  "<ucel>": 151665,
  "<xcel>": 151666,
  "<nl>": 151667,
  "<|rotate_up|>": 151668,
  "<|rotate_down|>": 151669,
  "<|rotate_left|>": 151670,
  "<|rotate_right|>": 151671,
  "<|txt_contd|>": 151672,
  "<|paratext|>": 151673
}
